Revit 2027 API
CriticalPathIterator.Reset Method
 Resets the iterator to the beginning segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Reset()
Public Overridable Sub Reset
public:
virtual void Reset()
abstract Reset : unit -> unit
override Reset : unit -> unit
See Also
Reference
CriticalPathIterator Class
Autodesk.Revit.DB.Analysis Namespace